public class lesson_07_16 {
    //метод main
    public static void main(String[] args) throws Exception{

    }
    //Доступ к методу main() возможен из любого класса, об этом говорит слово public.
    //
    //Метод статический (его можно явно вызвать в виде Solution.main()).
    //
    //Метод main не возвращает никакого результата. Тип результата — void (пустой тип/заглушка)
    //
    //Метод main принимает параметры(!): массив строк. И название args намекает на «аргументы программы». При запуске программы в нее можно передать параметры — массив строк. Они и будут содержаться в массиве args метода main().
    //
    //В методе main() могут возникать необработанные ошибки типа Exception (или его наследники).
}
